GopalSaraf/Practicals/PSDL/include/proc/pic18f87k22.inc
// Register: TMR12
#define TMR12 TMR12
TMR12                                    equ 0F32h
// bitfield definitions
TMR12_TMR12_POSN                         equ 0000h
TMR12_TMR12_POSITION                     equ 0000h
TMR12_TMR12_SIZE                         equ 0008h
TMR12_TMR12_LENGTH                       equ 0008h
TMR12_TMR12_MASK                         equ 00FFh

// Register: T10CON
#define T10CON T10CON
T10CON                                   equ 0F33h
// bitfield definitions
T10CON_T10CKPS_POSN                      equ 0000h
T10CON_T10CKPS_POSITION                  equ 0000h
T10CON_T10CKPS_SIZE                      equ 0002h
T10CON_T10CKPS_LENGTH                    equ 0002h
T10CON_T10CKPS_MASK                      equ 0003h
T10CON_TMR10ON_POSN                      equ 0002h
T10CON_TMR10ON_POSITION                  equ 0002h
T10CON_TMR10ON_SIZE                      equ 0001h
T10CON_TMR10ON_LENGTH                    equ 0001h
T10CON_TMR10ON_MASK                      equ 0004h
T10CON_T10OUTPS_POSN                     equ 0003h
T10CON_T10OUTPS_POSITION                 equ 0003h
T10CON_T10OUTPS_SIZE                     equ 0004h
T10CON_T10OUTPS_LENGTH                   equ 0004h
T10CON_T10OUTPS_MASK                     equ 0078h
T10CON_T10CKPS0_POSN                     equ 0000h
T10CON_T10CKPS0_POSITION                 equ 0000h
T10CON_T10CKPS0_SIZE                     equ 0001h
T10CON_T10CKPS0_LENGTH                   equ 0001h
T10CON_T10CKPS0_MASK                     equ 0001h
T10CON_T10CKPS1_POSN                     equ 0001h
T10CON_T10CKPS1_POSITION                 equ 0001h
T10CON_T10CKPS1_SIZE                     equ 0001h
T10CON_T10CKPS1_LENGTH                   equ 0001h
T10CON_T10CKPS1_MASK                     equ 0002h
T10CON_T10OUTPS0_POSN                    equ 0003h
T10CON_T10OUTPS0_POSITION                equ 0003h
T10CON_T10OUTPS0_SIZE                    equ 0001h
T10CON_T10OUTPS0_LENGTH                  equ 0001h
T10CON_T10OUTPS0_MASK                    equ 0008h
T10CON_T10OUTPS1_POSN                    equ 0004h
T10CON_T10OUTPS1_POSITION                equ 0004h
T10CON_T10OUTPS1_SIZE                    equ 0001h
T10CON_T10OUTPS1_LENGTH                  equ 0001h
T10CON_T10OUTPS1_MASK                    equ 0010h
T10CON_T10OUTPS2_POSN                    equ 0005h
T10CON_T10OUTPS2_POSITION                equ 0005h
T10CON_T10OUTPS2_SIZE                    equ 0001h
T10CON_T10OUTPS2_LENGTH                  equ 0001h
T10CON_T10OUTPS2_MASK                    equ 0020h
T10CON_T10OUTPS3_POSN                    equ 0006h
T10CON_T10OUTPS3_POSITION                equ 0006h
T10CON_T10OUTPS3_SIZE                    equ 0001h
T10CON_T10OUTPS3_LENGTH                  equ 0001h
T10CON_T10OUTPS3_MASK                    equ 0040h

// Register: PR10
#define PR10 PR10
PR10                                     equ 0F34h
// bitfield definitions
PR10_PR10_POSN                           equ 0000h
PR10_PR10_POSITION                       equ 0000h
PR10_PR10_SIZE                           equ 0008h
PR10_PR10_LENGTH                         equ 0008h
PR10_PR10_MASK                           equ 00FFh

// Register: TMR10
#define TMR10 TMR10
TMR10                                    equ 0F35h
// bitfield definitions
TMR10_TMR10_POSN                         equ 0000h
TMR10_TMR10_POSITION                     equ 0000h
TMR10_TMR10_SIZE                         equ 0008h
TMR10_TMR10_LENGTH                       equ 0008h
TMR10_TMR10_MASK                         equ 00FFh

// Register: T8CON
#define T8CON T8CON
T8CON                                    equ 0F36h
// bitfield definitions
T8CON_T8CKPS_POSN                        equ 0000h
T8CON_T8CKPS_POSITION                    equ 0000h
T8CON_T8CKPS_SIZE                        equ 0002h
T8CON_T8CKPS_LENGTH                      equ 0002h
T8CON_T8CKPS_MASK                        equ 0003h
T8CON_TMR8ON_POSN                        equ 0002h
T8CON_TMR8ON_POSITION                    equ 0002h
T8CON_TMR8ON_SIZE                        equ 0001h
T8CON_TMR8ON_LENGTH                      equ 0001h
T8CON_TMR8ON_MASK                        equ 0004h
T8CON_T8OUTPS_POSN                       equ 0003h
T8CON_T8OUTPS_POSITION                   equ 0003h
T8CON_T8OUTPS_SIZE                       equ 0004h
T8CON_T8OUTPS_LENGTH                     equ 0004h
T8CON_T8OUTPS_MASK                       equ 0078h
T8CON_T8CKPS0_POSN                       equ 0000h
T8CON_T8CKPS0_POSITION                   equ 0000h
T8CON_T8CKPS0_SIZE                       equ 0001h
T8CON_T8CKPS0_LENGTH                     equ 0001h
T8CON_T8CKPS0_MASK                       equ 0001h
T8CON_T8CKPS1_POSN                       equ 0001h
T8CON_T8CKPS1_POSITION                   equ 0001h
T8CON_T8CKPS1_SIZE                       equ 0001h
T8CON_T8CKPS1_LENGTH                     equ 0001h
T8CON_T8CKPS1_MASK                       equ 0002h
T8CON_T8OUTPS0_POSN                      equ 0003h
T8CON_T8OUTPS0_POSITION                  equ 0003h
T8CON_T8OUTPS0_SIZE                      equ 0001h
T8CON_T8OUTPS0_LENGTH                    equ 0001h
T8CON_T8OUTPS0_MASK                      equ 0008h
T8CON_T8OUTPS1_POSN                      equ 0004h
T8CON_T8OUTPS1_POSITION                  equ 0004h
T8CON_T8OUTPS1_SIZE                      equ 0001h
T8CON_T8OUTPS1_LENGTH                    equ 0001h
T8CON_T8OUTPS1_MASK                      equ 0010h
T8CON_T8OUTPS2_POSN                      equ 0005h
T8CON_T8OUTPS2_POSITION                  equ 0005h
T8CON_T8OUTPS2_SIZE                      equ 0001h
T8CON_T8OUTPS2_LENGTH                    equ 0001h
T8CON_T8OUTPS2_MASK                      equ 0020h
T8CON_T8OUTPS3_POSN                      equ 0006h
T8CON_T8OUTPS3_POSITION                  equ 0006h
T8CON_T8OUTPS3_SIZE                      equ 0001h
T8CON_T8OUTPS3_LENGTH                    equ 0001h
T8CON_T8OUTPS3_MASK                      equ 0040h

// Register: PR8
#define PR8 PR8
PR8                                      equ 0F37h
// bitfield definitions
PR8_PR8_POSN                             equ 0000h
PR8_PR8_POSITION                         equ 0000h
PR8_PR8_SIZE                             equ 0008h
PR8_PR8_LENGTH                           equ 0008h
PR8_PR8_MASK                             equ 00FFh

// Register: TMR8
#define TMR8 TMR8
TMR8                                     equ 0F38h
// bitfield definitions
TMR8_TMR8_POSN                           equ 0000h
TMR8_TMR8_POSITION                       equ 0000h
TMR8_TMR8_SIZE                           equ 0008h
TMR8_TMR8_LENGTH                         equ 0008h
TMR8_TMR8_MASK                           equ 00FFh

// Register: T6CON
#define T6CON T6CON
T6CON                                    equ 0F39h
// bitfield definitions
T6CON_T6CKPS_POSN                        equ 0000h
T6CON_T6CKPS_POSITION                    equ 0000h
T6CON_T6CKPS_SIZE                        equ 0002h
T6CON_T6CKPS_LENGTH                      equ 0002h
T6CON_T6CKPS_MASK                        equ 0003h
T6CON_TMR6ON_POSN                        equ 0002h
T6CON_TMR6ON_POSITION                    equ 0002h
T6CON_TMR6ON_SIZE                        equ 0001h
T6CON_TMR6ON_LENGTH                      equ 0001h
T6CON_TMR6ON_MASK                        equ 0004h
T6CON_T6OUTPS_POSN                       equ 0003h
T6CON_T6OUTPS_POSITION                   equ 0003h
T6CON_T6OUTPS_SIZE                       equ 0004h
T6CON_T6OUTPS_LENGTH                     equ 0004h
T6CON_T6OUTPS_MASK                       equ 0078h
T6CON_T6CKPS0_POSN                       equ 0000h
T6CON_T6CKPS0_POSITION                   equ 0000h
T6CON_T6CKPS0_SIZE                       equ 0001h
T6CON_T6CKPS0_LENGTH                     equ 0001h
T6CON_T6CKPS0_MASK                       equ 0001h
T6CON_T6CKPS1_POSN                       equ 0001h
T6CON_T6CKPS1_POSITION                   equ 0001h
T6CON_T6CKPS1_SIZE                       equ 0001h
T6CON_T6CKPS1_LENGTH                     equ 0001h
T6CON_T6CKPS1_MASK                       equ 0002h
T6CON_T6OUTPS0_POSN                      equ 0003h
T6CON_T6OUTPS0_POSITION                  equ 0003h
T6CON_T6OUTPS0_SIZE                      equ 0001h
T6CON_T6OUTPS0_LENGTH                    equ 0001h
T6CON_T6OUTPS0_MASK                      equ 0008h
T6CON_T6OUTPS1_POSN                      equ 0004h
T6CON_T6OUTPS1_POSITION                  equ 0004h
T6CON_T6OUTPS1_SIZE                      equ 0001h
T6CON_T6OUTPS1_LENGTH                    equ 0001h
T6CON_T6OUTPS1_MASK                      equ 0010h
T6CON_T6OUTPS2_POSN                      equ 0005h
T6CON_T6OUTPS2_POSITION                  equ 0005h
T6CON_T6OUTPS2_SIZE                      equ 0001h
T6CON_T6OUTPS2_LENGTH                    equ 0001h
T6CON_T6OUTPS2_MASK                      equ 0020h
T6CON_T6OUTPS3_POSN                      equ 0006h
T6CON_T6OUTPS3_POSITION                  equ 0006h
T6CON_T6OUTPS3_SIZE                      equ 0001h
T6CON_T6OUTPS3_LENGTH                    equ 0001h
T6CON_T6OUTPS3_MASK                      equ 0040h

// Register: PR6
#define PR6 PR6
PR6                                      equ 0F3Ah
// bitfield definitions
PR6_PR6_POSN                             equ 0000h
PR6_PR6_POSITION                         equ 0000h
PR6_PR6_SIZE                             equ 0008h
PR6_PR6_LENGTH                           equ 0008h
PR6_PR6_MASK                             equ 00FFh

// Register: TMR6
#define TMR6 TMR6
TMR6                                     equ 0F3Bh
// bitfield definitions
TMR6_TMR6_POSN                           equ 0000h
TMR6_TMR6_POSITION                       equ 0000h
TMR6_TMR6_SIZE                           equ 0008h
TMR6_TMR6_LENGTH                         equ 0008h
TMR6_TMR6_MASK                           equ 00FFh

// Register: T7GCON
#define T7GCON T7GCON
T7GCON                                   equ 0F3Ch
// bitfield definitions
T7GCON_T7GGO_NOT_T7DONE_POSN             equ 0003h
T7GCON_T7GGO_NOT_T7DONE_POSITION         equ 0003h
T7GCON_T7GGO_NOT_T7DONE_SIZE             equ 0001h
T7GCON_T7GGO_NOT_T7DONE_LENGTH           equ 0001h
T7GCON_T7GGO_NOT_T7DONE_MASK             equ 0008h
T7GCON_T7GSS_POSN                        equ 0000h
T7GCON_T7GSS_POSITION                    equ 0000h
T7GCON_T7GSS_SIZE                        equ 0002h
T7GCON_T7GSS_LENGTH                      equ 0002h
T7GCON_T7GSS_MASK                        equ 0003h
T7GCON_T7GVAL_POSN                       equ 0002h
T7GCON_T7GVAL_POSITION                   equ 0002h
T7GCON_T7GVAL_SIZE                       equ 0001h
T7GCON_T7GVAL_LENGTH                     equ 0001h
T7GCON_T7GVAL_MASK                       equ 0004h
T7GCON_T7GGO_nT7DONE_POSN                equ 0003h
T7GCON_T7GGO_nT7DONE_POSITION            equ 0003h
T7GCON_T7GGO_nT7DONE_SIZE                equ 0001h
T7GCON_T7GGO_nT7DONE_LENGTH              equ 0001h
T7GCON_T7GGO_nT7DONE_MASK                equ 0008h
T7GCON_T7GSPM_POSN                       equ 0004h
T7GCON_T7GSPM_POSITION                   equ 0004h
T7GCON_T7GSPM_SIZE                       equ 0001h
T7GCON_T7GSPM_LENGTH                     equ 0001h
T7GCON_T7GSPM_MASK                       equ 0010h
T7GCON_T7GTM_POSN                        equ 0005h
T7GCON_T7GTM_POSITION                    equ 0005h
T7GCON_T7GTM_SIZE                        equ 0001h
T7GCON_T7GTM_LENGTH                      equ 0001h
T7GCON_T7GTM_MASK                        equ 0020h
T7GCON_T7GPOL_POSN                       equ 0006h
T7GCON_T7GPOL_POSITION                   equ 0006h
T7GCON_T7GPOL_SIZE                       equ 0001h
T7GCON_T7GPOL_LENGTH                     equ 0001h
T7GCON_T7GPOL_MASK                       equ 0040h
T7GCON_TMR7GE_POSN                       equ 0007h
T7GCON_TMR7GE_POSITION                   equ 0007h
T7GCON_TMR7GE_SIZE                       equ 0001h
T7GCON_TMR7GE_LENGTH                     equ 0001h
T7GCON_TMR7GE_MASK                       equ 0080h
T7GCON_T7GSS0_POSN                       equ 0000h
T7GCON_T7GSS0_POSITION                   equ 0000h
T7GCON_T7GSS0_SIZE                       equ 0001h
T7GCON_T7GSS0_LENGTH                     equ 0001h
T7GCON_T7GSS0_MASK                       equ 0001h
T7GCON_T7GSS1_POSN                       equ 0001h
T7GCON_T7GSS1_POSITION                   equ 0001h
T7GCON_T7GSS1_SIZE                       equ 0001h
T7GCON_T7GSS1_LENGTH                     equ 0001h
T7GCON_T7GSS1_MASK                       equ 0002h
T7GCON_T7GGO_POSN                        equ 0003h
T7GCON_T7GGO_POSITION                    equ 0003h
T7GCON_T7GGO_SIZE                        equ 0001h
T7GCON_T7GGO_LENGTH                      equ 0001h
T7GCON_T7GGO_MASK                        equ 0008h
T7GCON_NOT_T7DONE_POSN                   equ 0003h
T7GCON_NOT_T7DONE_POSITION               equ 0003h
T7GCON_NOT_T7DONE_SIZE                   equ 0001h
T7GCON_NOT_T7DONE_LENGTH                 equ 0001h
T7GCON_NOT_T7DONE_MASK                   equ 0008h
T7GCON_nT7DONE_POSN                      equ 0003h
T7GCON_nT7DONE_POSITION                  equ 0003h
T7GCON_nT7DONE_SIZE                      equ 0001h
T7GCON_nT7DONE_LENGTH                    equ 0001h
T7GCON_nT7DONE_MASK                      equ 0008h

